# ** Fusion du fichier NO2 avec adresses des stations et CP


##     - Charger le fichier No2 
##     - Charger le ficher qui contient les code des stations et les adresses
##     - Fusionner les deux fichiers 

##     *** Résultat : dataframe ayant la structure ci-dessous:
          [date, heure, station, taux_no2, station_name, station_adress, zip_code]

In [1]:
import pandas as pd

# Charger le fichier NO2

In [2]:
data_no2 = pd.read_csv("20180101_20201212-NO2_auto.csv", sep=";")

In [3]:
data_no2.head()

,date,heure,EVRY,PA01H,LOGNES,VILLEM,GEN,MELUN,ARG,GON,...,MONTG,SOULT,CELES,ELYS,EIFF3,TREMB,AUB,IVRY,BP_EST,PA07
0,NaN,NaN,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,...,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3
1,01/01/2018,1.0,4,n/d,6,5,5,5,n/d,6,...,5,14,21,20,2,9,12,5,13,n/d
2,01/01/2018,2.0,4,n/d,6,6,5,5,n/d,6,...,4,14,16,52,2,9,13,5,15,n/d
3,01/01/2018,3.0,4,n/d,6,8,6,6,n/d,7,...,7,16,16,31,3,10,12,6,20,n/d
4,01/01/2018,4.0,3,n/d,6,8,6,6,n/d,7,...,6,20,15,34,3,10,14,8,25,n/d

# Transformer les noms de stattions et mesures en colonnes (melt)

In [4]:
data_no2_pivot = pd.melt(data_no2, id_vars = ["date", "heure"], var_name= "station", value_name="taux_no2")

In [5]:
data_no2_pivot.head()

         date  heure station   taux_no2
0         NaN    NaN    EVRY  microg/m3
1  01/01/2018    1.0    EVRY          4
2  01/01/2018    2.0    EVRY          4
3  01/01/2018    3.0    EVRY          4
4  01/01/2018    4.0    EVRY          3

In [6]:
data_no2_pivot.shape

(1085658, 4)

# Supprimer les mesures liées aux stations qui sont en dehors de Paris

In [7]:
st_paris = data_no2.drop(columns =["GON","A1","MANT","MELUN","TREMB","VERS","RUR-SE","RUR-SO","RN2","RN20","RN6","ARG","AUB","BOB",
                          "CHAMP","DEF","EVRY","GEN","LOGNES","MONTG","NEUIL","STDEN","VILLEM","VITRY", "IVRY"])

In [8]:
st_paris.columns

Index(['date', 'heure', 'PA01H', 'PA13', 'PA15L', 'PA18', 'PA04C', 'OPERA',
       'HAUS', 'BONAP', 'AUT', 'BASCH', 'PA12', 'SOULT', 'CELES', 'ELYS',
       'EIFF3', 'BP_EST', 'PA07'],
      dtype='object')

In [9]:
#st_paris.columns = ["date","heure","75001", "75013", "75015", "75018", "PA04C","75009", "75008", "75006",
#                   "AUT(75016)", "75014", "75012", "SOULT", "75004", "75008",
#VRY                   "75007", "BP_EST", "75007"]

In [10]:
#st_paris.drop(0)
st_paris.head()

,date,heure,PA01H,PA13,PA15L,PA18,PA04C,OPERA,HAUS,BONAP,AUT,BASCH,PA12,SOULT,CELES,ELYS,EIFF3,BP_EST,PA07
0,NaN,NaN,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3,microg/m3
1,01/01/2018,1.0,n/d,9,4,14,17,n/d,53,25,n/d,23,8,14,21,20,2,13,n/d
2,01/01/2018,2.0,n/d,9,4,14,14,n/d,44,21,n/d,23,10,14,16,52,2,15,n/d
3,01/01/2018,3.0,n/d,11,4,14,15,n/d,46,24,n/d,30,9,16,16,31,3,20,n/d
4,01/01/2018,4.0,n/d,11,4,15,13,n/d,40,23,n/d,27,9,20,15,34,3,25,n/d

In [11]:
st_paris.shape

(25849, 19)

In [12]:
st_paris_pivot = pd.melt(st_paris, id_vars=["date", "heure"], var_name = "stations", value_name="taux_no2")

In [13]:
st_paris_pivot.head()

         date  heure stations   taux_no2
0         NaN    NaN    PA01H  microg/m3
1  01/01/2018    1.0    PA01H        n/d
2  01/01/2018    2.0    PA01H        n/d
3  01/01/2018    3.0    PA01H        n/d
4  01/01/2018    4.0    PA01H        n/d

# ** Staions No2 Paris

# Charger le fichier (résultat du scrapping) contenant les codes stations et adresses

In [14]:
stations_paris = pd.read_csv("stationsNO2_paris.csv")

In [15]:
stations_paris.columns = ["station", "station_name", "station_adress", "zip_code"]

In [16]:
type(data_no2_pivot["station"])

pandas.core.series.Series

In [17]:
data_no2_pivot.head()

         date  heure station   taux_no2
0         NaN    NaN    EVRY  microg/m3
1  01/01/2018    1.0    EVRY          4
2  01/01/2018    2.0    EVRY          4
3  01/01/2018    3.0    EVRY          4
4  01/01/2018    4.0    EVRY          3

In [18]:
len(data_no2_pivot)

1085658

# ** Fusionner les deux fichiers

In [19]:
result = data_no2_pivot.merge(stations_paris, on='station')

In [20]:
result = result.drop(0)
result.head()

,date,heure,station,taux_no2,station_name,station_adress,zip_code
1,01/01/2018,1.0,PA01H,n/d,PARIS 1er Les Halles,"Jardin des Halles-Al J. Supervielle 75001, Par...",75001
2,01/01/2018,2.0,PA01H,n/d,PARIS 1er Les Halles,"Jardin des Halles-Al J. Supervielle 75001, Par...",75001
3,01/01/2018,3.0,PA01H,n/d,PARIS 1er Les Halles,"Jardin des Halles-Al J. Supervielle 75001, Par...",75001
4,01/01/2018,4.0,PA01H,n/d,PARIS 1er Les Halles,"Jardin des Halles-Al J. Supervielle 75001, Par...",75001
5,01/01/2018,5.0,PA01H,n/d,PARIS 1er Les Halles,"Jardin des Halles-Al J. Supervielle 75001, Par...",75001

# ** Sauvegarder le resultat dans un fichier csv

In [67]:
result.to_csv("stations_paris_jupyter.csv", index=False)